cookease/app/controllers/ingredients_controller.rb

  def index
    ingredients = Ingredient.all();
---
SELECT "ingredients".* FROM "ingredients"

  def create
    ingredient = Ingredient.create( ingredient_params )
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Chocolate"], ["created_at", 2017-02-28 14:25:47 UTC], ["updated_at", 2017-02-28 14:25:47 UTC]]