cookease/app/controllers/recipes_controller.rb

  def index
    recipes = Recipe.all();
---
SELECT "recipes".* FROM "recipes"

  def show
    recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]